------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Jose Pablo\Dropbox\NK trade\JP\Data_Construction\1-Codes\3-Log_Files\1-wiod.log
  log type:  text
 opened on:  13 Mar 2020, 17:30:45

. 
. /*
> ***********************************************************************************************************************************************
> ***     THIS DO FILE DOES THE FOLLOWING:
> ***********************************************************************************************************************************************
> Takes WIOD and maps to the 14 relevant sectors that we consider
> */
. 
. ********************** 
. ***  INPUT FILES   ***  
. **********************
. global wiot ""1-Intermediate_Processed_Data\wiot_full.dta""

. 
. ********************** 
. ***  OUTPUT FILES  ***  
. **********************
. global WIOD_countries "2-Final_Data\WIOD_countries.dta"

. 
. use $wiot, clear

. 
. ***********************************************************************************************************************************************
. ***********************************************************************************************************************************************
. *** 2. ASSIGNS SAME CORRESPONDANCES AS IN CDP, SO THAT THE SECTORS ARE EQUIVALENT AS THOSE
. *** IN WIOD.
. ***********************************************************************************************************************************************
. ***********************************************************************************************************************************************
. /*
> ***********************************************************************************************************************************************
> ***     MANUFACTURING SECTORS USED AND THEIR MAPPING TO WIOD (indexed by ci)
> ***********************************************************************************************************************************************
> 1.      (NAICS 311–312) Food Products, Beverage, and Tobacco Products (c3);
> 2.      (NAICS 313–316) Textile, Textile Product Mills, Apparel, Leather, and Allied Products (c4–c5); 
> 3.      (NAICS 321–323) Wood Products, Paper, Printing, and Related Sup- port Activities (c6–c7); 
> 4.      (NAICS 324) Petroleum and Coal Products (c8);
> 5.      (NAICS 325) Chemical (c9); 
> 6.      (NAICS 326) Plastics and Rubber Products (c10); 
> 7.      (NAICS 327) Nonmetallic Mineral Products (c11); 
> 8.      (NAICS 331–332) Primary Metal and Fabricated Metal Products (c12); 
> 9.      (NAICS 333); Machinery (c13); 
> 10.     (NAICS 334–335) Computer and Electronic Products, and Electrical Equipment and Appliances (c14);
> 11.     (NAICS 336) Transportation Equipment (c15); 
> 12.     (NAICS 337– 339) Furniture and Related Products, and Miscellaneous Manufacturing (c16); 
> 13.     ((NAICS 23) Construction (c18); 
> 14.     (NAICS 42-45) Wholesale and Retail Trade (c19–c21); 
> 15.     (NAICS 481-488) Transport Services (c23–c26);
> 16.     (NAICS 511–518) Information Services (c27); 
> 17.     (NAICS 521–525) Finance and Insurance (c28); 
> 18.     (NAICS 531-533)  Real Estate (c29–c30); 
> 19.     (NAICS 61) Education (c32); 
> 20.     (NAICS 621–624) Health Care (c33); 
> 21.     (NAICS 721–722) Accommodation and Food Services (c22); 
> 22.     (NAICS 493, 541, 55, 561, 562, 711–713, 811-814) Other Services (c34).
> 23.     (NAICS 111-115, 211-213) Agriculture and Mining (c1-c2).
> */
. gen row_sector=.
(28240800 missing values generated)

. *1.     (NAICS 311–312) Food Products, Beverage, and Tobacco Products (c3);
. replace row_sector=1 if row_item==3
(806880 real changes made)

. *2.     (NAICS 313–316) Textile, Textile Product Mills, Apparel, Leather, and Allied Products (c4–c5);
. replace row_sector=2 if row_item==4 | row_item==5
(1613760 real changes made)

. *3.     (NAICS 321–323) Wood Products, Paper, Printing, and Related Sup- port Activities (c6–c7); 
. replace row_sector=3 if row_item==6 | row_item==7
(1613760 real changes made)

. *4.     (NAICS 324) Petroleum and Coal Products (c8);
. replace row_sector=4 if row_item==8
(806880 real changes made)

. *5.     (NAICS 325) Chemical (c9);
. replace row_sector=5 if row_item==9
(806880 real changes made)

. *6.     (NAICS 326) Plastics and Rubber Products (c10); 
. replace row_sector=6 if row_item==10
(806880 real changes made)

. *7.     (NAICS 327) Nonmetallic Mineral Products (c11); 
. replace row_sector=7 if row_item==11
(806880 real changes made)

. *8.     (NAICS 331–332) Primary Metal and Fabricated Metal Products (c12); 
. replace row_sector=8 if row_item==12
(806880 real changes made)

. *9.     (NAICS 333); Machinery (c13); 
. replace row_sector=9 if row_item==13
(806880 real changes made)

. *10.    (NAICS 334–335) Computer and Electronic Products, and Electrical Equipment and Appliances (c14);
. replace row_sector=10 if row_item==14
(806880 real changes made)

. *11.    (NAICS 336) Transportation Equipment (c15); 
. replace row_sector=11 if row_item==15
(806880 real changes made)

. *12.    (NAICS 337– 339) Furniture and Related Products, and Miscellaneous Manufacturing (c16); 
. replace row_sector=12 if row_item==16
(806880 real changes made)

. *13.    ((NAICS 23) Construction (c18); 
. replace row_sector=13 if row_item==18
(806880 real changes made)

. *14.    (NAICS 42-45) Wholesale and Retail Trade (c19–c21); 
. replace row_sector=14 if row_item==19 | row_item==20 | row_item==21 
(2420640 real changes made)

. *15.    (NAICS 481-488) Transport Services (c23–c26);
. replace row_sector=15 if row_item==23 | row_item==24 | row_item==25 | row_item==26 
(3227520 real changes made)

. *16.    (NAICS 511–518) Information Services (c27);
. replace row_sector=16 if row_item==27 
(806880 real changes made)

. *17.    (NAICS 521–525) Finance and Insurance (c28); 
. replace row_sector=17 if row_item==28 
(806880 real changes made)

. *18.    (NAICS 531-533)  Real Estate (c29–c30); 
. replace row_sector=18 if row_item==29 | row_item==30  
(1613760 real changes made)

. *19.    (NAICS 61) Education (c32); 
. replace row_sector=19 if row_item==32 
(806880 real changes made)

. *20.    (NAICS 621–624) Health Care (c33);
. replace row_sector=20 if row_item==33 
(806880 real changes made)

. *21.    (NAICS 721–722) Accommodation and Food Services (c22); 
. replace row_sector=21 if row_item==22 
(806880 real changes made)

. *22.    (NAICS 493, 541, 55, 561, 562, 711–713, 811-814) Other Services (c34).
. replace row_sector=22 if row_item==34 
(806880 real changes made)

. *23.    (NAICS 111-115) Agriculture, Forestry, Fishing, and Hunting (c1)
. *Mining, Quarrying, and Oil and Gas Extraction (c2). 
. replace row_sector=23 if row_item==1  | row_item==2 
(1613760 real changes made)

. keep if row_sector!=. 
(2420640 observations deleted)

. *checks that we have 23 manuf sectors
. distinct row_sector 

            |        Observations
            |      total   distinct
------------+----------------------
 row_sector |   2.58e+07         23

. assert `r(ndistinct)'==23

. 
. * only sending sector
. collapse (sum) value , by(*_country row_sector year)

. ***********************************************************************************************************************************************
. ***     Relevant countries
. ***********************************************************************************************************************************************
. gen importer=.
(463956 missing values generated)

. gen exporter=.
(463956 missing values generated)

. replace col_country="ROU" if col_country=="ROM"
(0 real changes made)

. replace row_country="ROU" if row_country=="ROM"
(0 real changes made)

. replace importer=1 if col_country=="USA"
(11316 real changes made)

. replace exporter=1 if row_country=="USA"
(11316 real changes made)

. 
. scalar j=51

. local countries "AUS AUT BEL BGR BRA CAN CHN CYP CZE DEU DNK ESP EST FIN FRA GBR GRC HUN IDN IND IRL ITA JPN KOR LTU MEX NLD POL PRT ROU RoW RUS SVK
>  SVN SWE TUR TWN"

. foreach v of local countries{
  2. replace importer=`=j' if col_country=="`v'"
  3. replace exporter=`=j' if row_country=="`v'"
  4. scalar j=`=j'+1
  5. }
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)
(11316 real changes made)

. 
. drop if importer==. | exporter==.
(65412 observations deleted)

. distinct row_country if importer!=. 

             |        Observations
             |      total   distinct
-------------+----------------------
 row_country |     398544         38

. assert `r(ndistinct)'==38

. distinct row_country if exporter!=. 

             |        Observations
             |      total   distinct
-------------+----------------------
 row_country |     398544         38

. assert `r(ndistinct)'==38

. ***********************************************************************************************************************************************
. ***     GENERATE MATRIX
. ***********************************************************************************************************************************************
. keep value col_country importer row_sector exporter year

. reshape wide value, i(col_country importer row_sector year) j(exporter)
(note: j = 1 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                   398544   ->   10488
Number of variables                   6   ->      42
j variable (38 values)         exporter   ->   (dropped)
xij variables:
                                  value   ->   value1 value51 ... value87
-----------------------------------------------------------------------------

. 
. rename value1 value_USA

. scalar j=51

. local countries "AUS AUT BEL BGR BRA CAN CHN CYP CZE DEU DNK ESP EST FIN FRA GBR GRC HUN IDN IND IRL ITA JPN KOR LTU MEX NLD POL PRT ROU RoW RUS SVK
>  SVN SWE TUR TWN"

. foreach v of local countries{
  2. rename value`=j' value_`v'
  3. scalar j=`=j'+1
  4. }

. rename col_country importer_country

. rename row_sector sector

. ***********************************************************************************************************************************************
. ***     SERVICES AND AGRICULTURE
. ***********************************************************************************************************************************************
. *SERVICES IN ONE SECTOR
. gen serv=(sector>=13 & sector<23)

. ds value_*
value_USA  value_BEL  value_CAN  value_CZE  value_ESP  value_FRA  value_HUN  value_IRL  value_KOR  value_NLD  value_ROU  value_SVK  value_TUR
value_AUS  value_BGR  value_CHN  value_DEU  value_EST  value_GBR  value_IDN  value_ITA  value_LTU  value_POL  value_RoW  value_SVN  value_TWN
value_AUT  value_BRA  value_CYP  value_DNK  value_FIN  value_GRC  value_IND  value_JPN  value_MEX  value_PRT  value_RUS  value_SWE

. foreach v in `r(varlist)'{
  2. capture drop temp*
  3. gen double temp=serv*`v'
  4. bys importer_c year importer: egen temp2=total(temp)
  5. replace `v'=temp2 if serv==1
  6. drop temp*
  7. }
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)
(4560 real changes made)

. drop if sector>13 & sector<23
(4104 observations deleted)

. drop serv

. *agriculture and mining as sector 14
. replace sector=14 if sector==23
(456 real changes made)

. sort year sector importer

. 
. save $WIOD_countries, replace
file 2-Final_Data\WIOD_countries.dta saved

. 
end of do-file

. exit, clear
