------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Jose Pablo\Dropbox\NK trade\JP\Data_Construction\RUV\1-Data-Codes\3-Log_Files\2-2-state_imports_exports.log
  log type:  text
 opened on:  22 Apr 2020, 13:58:00

. 
. /*
> ***********************************************************************************************************************************************
> ***     THIS DO FILE DOES THE FOLLOWING:
> ***********************************************************************************************************************************************
> Takes imports and exports data from census and changes the 
> sectors for those we use
> */
. 
. ********************** 
. ***  INPUT FILES   ***  
. **********************
. global imports ""1-Intermediate_Processed_Data\census_imports.dta""

. global exports ""1-Intermediate_Processed_Data\census_exports.dta""

. 
. ********************** 
. ***  OUTPUT FILES  ***  
. **********************
. global state_imports_exports "1-Intermediate_Processed_Data\state_imports_exports.dta"

. 
. foreach v in exports imports {
  2. use ${`v'}, clear
  3. destring year, replace
  4. ***
. *** COUNTRIES OF CDP/WIOD
. ***
. capture rename origin country
  5. capture rename destination country
  6. capture rename exports value
  7. capture rename imports value
  8. quiet{
  9. drop if state=="Dist of Columbia"
 10. drop if state=="Puerto Rico"
 11. drop if state=="US Virgin Islands"
 12. drop if state=="Unknown"
 13. 
. drop if country=="APEC - Asia Pacific Economic Co-operation"
 14. drop if country=="ASEAN - Association of Southeast Asian Nations"
 15. drop if country=="Asia"
 16. drop if country=="Australia and Oceania"
 17. drop if country=="Central American Common Market"
 18. drop if country=="Euro Area"
 19. drop if country=="Europe"
 20. drop if country=="European Union"
 21. drop if country=="LAFTA - Latin American Free Trade Association"
 22. drop if country=="NATO (North Atlantic Treaty Organization) Allies"
 23. drop if country=="NICS - Newly Industrialized Countries"
 24. drop if country=="OECD - Organization for Economic Co-operation and Development"
 25. drop if country=="OPEC - Organization of Petroleum Exporting Countries"
 26. drop if country=="North America"
 27. drop if country=="Pacific Rim Countries"
 28. drop if country=="South/Central America"
 29. drop if country=="Twenty Latin American Republics"
 30. drop if country=="US Trade Agreements Partners"
 31. drop if country=="Western Sahara"
 32. gen region=""
 33. replace region="AUS" if country=="Australia"
 34. replace region="AUT" if country=="Austria"
 35. replace region="BEL" if country=="Belgium"
 36. replace region="BRA" if country=="Brazil"
 37. replace region="BGR" if country=="Bulgaria"
 38. replace region="CAN" if country=="Canada"
 39. replace region="CHN" if country=="China"
 40. replace region="CYP" if country=="Cyprus"
 41. replace region="CZE" if country=="Czech Republic"
 42. replace region="DNK" if country=="Denmark"
 43. replace region="EST" if country=="Estonia"
 44. replace region="FIN" if country=="Finland"
 45. replace region="FRA" if country=="France"
 46. replace region="GBR" if country=="United Kingdom"
 47. replace region="DEU" if country=="Germany"
 48. replace region="GRC" if country=="Greece"
 49. replace region="HUN" if country=="Hungary"
 50. replace region="IND" if country=="India"
 51. replace region="IDN" if country=="Indonesia"
 52. replace region="IRL" if country=="Ireland"
 53. replace region="ITA" if country=="Italy"
 54. replace region="JPN" if country=="Japan"
 55. replace region="KOR" if country=="Korea, South"
 56. replace region="LTU" if country=="Lithuania"
 57. replace region="MEX" if country=="Mexico"
 58. replace region="NLD" if country=="Netherlands"
 59. replace region="POL" if country=="Poland"
 60. replace region="PRT" if country=="Portugal"
 61. replace region="ROU" if country=="Romania"
 62. replace region="RUS" if country=="Russia"
 63. replace region="SVK" if country=="Slovakia"
 64. replace region="SVN" if country=="Slovenia"
 65. replace region="ESP" if country=="Spain"
 66. replace region="SWE" if country=="Sweden"
 67. replace region="TWN" if country=="Taiwan"
 68. replace region="TUR" if country=="Turkey"
 69. distinct region
 70. assert `r(ndistinct)'==36
 71. replace region="RoW" if region=="" 
 72. collapse (sum) value, by(state naics year region)
 73. if "`v'"=="exports"{
 74. rename state origin
 75. rename region destination
 76. }
 77. if "`v'"=="imports"{
 78. rename state destination 
 79. rename region origin
 80. }
 81. }
 82. 
. ***
. *** SECTORS OF CDP/WIOD
. ***
. drop if naics3d=="All Commodities"
 83. gen sec_naics=substr(naics3d,1,3)
 84. destring sec_naics, replace
 85. /*
> ***********************************************************************************************************************************************
> ***      SECTORS USED AND THEIR MAPPING TO WIOD (indexed by ci)
> ***********************************************************************************************************************************************
> 1.      (NAICS 311–312) Food Products, Beverage, and Tobacco Products (c3);
> 2.      (NAICS 313–316) Textile, Textile Product Mills, Apparel, Leather, and Allied Products (c4–c5); 
> 3.      (NAICS 321–323) Wood Products, Paper, Printing, and Related Sup- port Activities (c6–c7); 
> 4.      (NAICS 324 , 211-213) Petroleum and Coal Products and mining (c2, c8);
> 5.      (NAICS 325) Chemical (c9); 
> 6.      (NAICS 326) Plastics and Rubber Products (c10); 
> 7.      (NAICS 327) Nonmetallic Mineral Products (c11); 
> 8.      (NAICS 331–332) Primary Metal and Fabricated Metal Products (c12); 
> 9.      (NAICS 333); Machinery (c13); 
> 10.     (NAICS 334–335) Computer and Electronic Products, and Electrical Equipment and Appliances (c14);
> 11.     (NAICS 336) Transportation Equipment (c15); 
> 12.     (NAICS 337– 339) Furniture and Related Products, and Miscellaneous Manufacturing (c16); 
> 13.     ((NAICS XX) Construction (c18); 
> 14.     (NAICS 42-45) Wholesale and Retail Trade (c19–c21); 
> 15.     (NAICS 481-488) Transport Services (c23–c26);
> 16.     (NAICS 511–518) Information Services (c27); 
> 17.     (NAICS 521–525) Finance and Insurance (c28); 
> 18.     (NAICS 531-533)  Real Estate (c29–c30); 
> 19.     (NAICS 61) Education (c32); 
> 20.     (NAICS 621–624) Health Care (c33); 
> 21.     (NAICS 721–722) Accommodation and Food Services (c22); 
> 22.     (NAICS 493, 541, 55, 561, 562, 711–713, 811-814) Other Services (c34).
> 23.     (NAICS 111-115) Agriculture (c1).
> */
. gen sector=.
 86. *1.     (NAICS 311–312) Food Products, Beverage, and Tobacco Products (c3);
. replace sector=1 if sec_naics==311 | sec_naics==312
 87. *2.     (NAICS 313–316) Textile, Textile Product Mills, Apparel, Leather, and Allied Products (c4–c5);
. replace sector=2 if sec_naics==313 | sec_naics==314 | sec_naics==315 | sec_naics==316
 88. *3.     (NAICS 321–323) Wood Products, Paper, Printing, and Related Sup- port Activities (c6–c7); 
. replace sector=3 if sec_naics==321 | sec_naics==322 | sec_naics==323
 89. *4.     (NAICS 324, 211-213) Petroleum and Coal Products (c8) and mining (c2);
. replace sector=4 if sec_naics==324 | sec_naics==211 | sec_naics==212 |sec_naics==213
 90. *5.     (NAICS 325) Chemical (c9);
. replace sector=5 if sec_naics==325
 91. *6.     (NAICS 326) Plastics and Rubber Products (c10); 
. replace sector=6 if sec_naics==326
 92. *7.     (NAICS 327) Nonmetallic Mineral Products (c11); 
. replace sector=7 if sec_naics==327
 93. *8.     (NAICS 331–332) Primary Metal and Fabricated Metal Products (c12); 
. replace sector=8 if sec_naics==331 | sec_naics==332
 94. *9.     (NAICS 333); Machinery (c13); 
. replace sector=9 if sec_naics==333
 95. *10.    (NAICS 334–335) Computer and Electronic Products, and Electrical Equipment and Appliances (c14);
. replace sector=10 if sec_naics==334 | sec_naics==335
 96. *11.    (NAICS 336) Transportation Equipment (c15); 
. replace sector=11 if sec_naics==336
 97. *12.    (NAICS 337– 339) Furniture and Related Products, and Miscellaneous Manufacturing (c16); 
. replace sector=12 if sec_naics==337 | sec_naics==338 | sec_naics==339
 98. *16.    (NAICS 511–518) Information Services (c27);
. replace sector=16 if sec_naics==511 
 99. *14.    (NAICS 111-115, 211-213) Agriculture and Mining (c1).
. replace sector=14 if sec_naics<=115 
100. keep if sector!=. 
101. *checks that we have all manuf sectors
. distinct sector 
102. assert `r(ndistinct)'==14
103. 
. * only sending sector
. collapse (sum) value , by(year sector destination origin)
104. if "`v'"=="exports"{
105. gen file="i in US, j not in US"
106. }
107. if "`v'"=="imports"{
108. gen file="i not in US, j in US"
109. }
110. tempfile `v'
111. save ``v'', replace
112. }
year already numeric; no replace
(0 observations deleted)
sec_naics has all characters numeric; replaced as int
(661575 missing values generated)
(38905 real changes made)
(81516 real changes made)
(66757 real changes made)
(38457 real changes made)
(30003 real changes made)
(27821 real changes made)
(24702 real changes made)
(54504 real changes made)
(31898 real changes made)
(61905 real changes made)
(30162 real changes made)
(51669 real changes made)
(6932 real changes made)
(56685 real changes made)
(59659 observations deleted)

        |        Observations
        |      total   distinct
--------+----------------------
 sector |     601916         14
(note: file C:\Users\JOSEPA~1\AppData\Local\Temp\ST_00000001.tmp not found)
file C:\Users\JOSEPA~1\AppData\Local\Temp\ST_00000001.tmp saved
year already numeric; no replace
(0 observations deleted)
sec_naics has all characters numeric; replaced as int
(456522 missing values generated)
(27539 real changes made)
(69148 real changes made)
(43802 real changes made)
(18982 real changes made)
(19031 real changes made)
(19759 real changes made)
(17826 real changes made)
(36672 real changes made)
(20947 real changes made)
(40817 real changes made)
(18880 real changes made)
(37614 real changes made)
(1501 real changes made)
(32221 real changes made)
(51783 observations deleted)

        |        Observations
        |      total   distinct
--------+----------------------
 sector |     404739         14
(note: file C:\Users\JOSEPA~1\AppData\Local\Temp\ST_00000002.tmp not found)
file C:\Users\JOSEPA~1\AppData\Local\Temp\ST_00000002.tmp saved

. clear

. use `exports'

. append using `imports'
(note: variable destination was str3, now str17 to accommodate using data's values)

. replace sector=13 if sector>12 & sector!=14
(8433 real changes made)

. 
. save $state_imports_exports, replace
file 1-Intermediate_Processed_Data\state_imports_exports.dta saved

. 
end of do-file
